const Terms = () => (
  <div className="flex flex-col">
    <h2 className="font-bold text-xl text-black dark:text-white my-4">Условия использования</h2>
    <p className="text-sm text-gray-400">Все материалы и встроенные инструменты, в том числе проигрыватели, которые присутствуют на данном сайте, представлены исключительно в ознакомительных целях. Ссылки на видеопотоки берутся только из открытых источников.На сайте Час.ТВ существует возрастное ограничение. Если пользователь не достиг 18-летнего возраста, то ему рекомендуется покинуть данный ресурс.</p>
    <h3 className="font-bold text-medium text-black dark:text-white my-4">Пользовательское соглашение</h3>
    <ul className=" text-sm text-black dark:text-whitee">
      <li className="mb-2">
        <span className="font-bold">1. Общие положения</span>
        <ol className=" mt-2 text-gray-400">
          <li>1.1. Пользователь автоматически принимает условия данного соглашения, если он начинает использовать данный сайт. Если пользователь не согласен с каким либо из пунктов, то ему лучше покинуть данный сайт.</li>
        </ol>
      </li>
      <li className=" my-2">
        <span className="font-bold">2. Использование сайта</span>
        <ol className=" mt-2 text-gray-400">
          <li>2.1. Пользователь сам несет ответственность за те действия, которые совершены под его учетной записью, даже если его аккаунт был взломан ли же пароль был передан третьим лицам.</li>
          <li>пропагандировать насилие, жестокость, дискриминацию, размещать неправдивый, зараженный или клеветнический контент, нарушать права интеллектуальной собственности, размещать материалы, оскорбляющие нравственность, содержащие элементы порнографического или эротического характера, инструкции по изготовлению или применению взрывчатки или оружия; размещать или передавать любой контент, не являясь законным его правообладателем или доверенным лицом; распространять спам, использовать сайт для сетевого маркетинга, популяризации «пирамид», способов интернет-заработка и пр.; распространять через сайт вирусы; собирать, хранить и распространять информацию о других пользователей данного ресурса; влиять на работу сайта.</li>
        </ol>
      </li>
      <li className=" my-2">
        <span className="font-bold"> 3. Права на элементы сайта и контент</span>
        <ol className=" mt-2 text-gray-400">
          <li>3.1. Все элементы, используемые на сайте, принадлежат администрации, пользователям и другим правообладателям.</li>
          <li>3.2. Использование элементов и имеющегося на сайте контента разрешается только в том случае, если получено официальное разрешение от законного правообладателя.</li>
          <li>3.3. При использовании элементов сайта в личных некоммерческих целях необходимо обязательно сохранить все знаки, обеспечивающие охрану авторского права.</li>
        </ol>
      </li>
      <li className=" my-2">
        <span className="font-bold">4. Контент третьих лиц</span>
        <ol className=" mt-2 text-gray-400">
          <li>4.1. На сайте могут присутствовать ссылки на другие статьи и сайты. Администрация не несет ответственность за материалы, размещенные на других ресурсах, и не проверяет их на достоверность и законность.</li>
          <li>4.2. Размещенную ссылку на другой сайт не стоит расценивать как рекомендацию со стороны администрации.</li>
        </ol>
      </li>
      <li className=" my-2">
        <span className="font-bold">5. Сбор информации</span>
        <ol className=" mt-2 text-gray-400">
          <li>5.1. Во время посещения пользователем сайта Час.ТВ собирается только статистическая информация (страна, провайдер и активность переходов по страницам), а также та, которую пользователь предоставляет сам, заполняя свою учетную запись.</li>
          <li>5.2. Для сбора статистических данных на сайте используется технология cookies.</li>
          <li>5.3. Вся собранная информация не продается и не передается третьим лицам ни при каких условиях, за исключением случаев, предусмотренных законодательством.</li>
          <li>5.4. Между администрацией сайта и компанией Google действуют партнерские соглашения, согласно которым последняя может размещать на страницах сайта рекламу, включая стандартные объявления, материалы рекламного характера и гиперссылки в тексте. Чтобы информация была максимально полезной пользователю, используются также файлы cookies. Они позволяют анализировать предыдущие посещения страниц сайта и на основе этой информации подбирать наиболее релевантный рекламный контент.</li>
          <li>5.5. Администрация сайта и партнеры показывают рекламные объявления благодаря файлам cookie DoubleClick.</li>
          <li>5.6. Если пользователь хочет отказаться от их использования, сделать он это может с помощью внесения изменений в менеджер рекламных предпочтений.</li>
        </ol>
      </li>
      <li className=" my-2">
        <span className="font-bold">6. Ответственность</span>
        <ol className=" mt-2 text-gray-400">
          <li>6.1. Администрация сайта не берет на себя никакую ответственность, в том числе и в случае несоответствия сайта требованиям пользователя и нанесения пользователю убытков во время использования сайта.</li>
        </ol>
      </li>
    </ul>
  </div>
);

export default Terms;
